holographicSol/SatIO_ESP32-P4/SatIO/src/task_handler.cpp
      // test 7 segment 4 digit display 1
      update7Segment4Digit(I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0,
      1,
      gnggaData.gps_precision_factor);

      // test 7 segment 6 digit display 0
      update7Segment6Digit(I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0,
      2,
      satioData.padded_local_time_HHMMSS
      );

      // test 7 segment 6 digit display 1
      update7Segment6Digit(I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0,
      3,
      satioData.padded_local_short_date_DDMMYY
      );

      // test SSD1306 0
      updateSSD1306(I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0,
      0,
      0,
      1, 1,
      gnggaData.satellite_count
      );
      updateSSD1306(I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0,
        0,
        1,
        1, 12,
        satioData.formatted_local_time_HHMMSS
      );
      drawSSD1306Canvas(I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, 0);
      
      // test SSD1306 1
      updateSSD1306(I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0,
      1,
      0,
      1, 1,
      gnggaData.satellite_count
      );
      updateSSD1306(I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0,
      1,
      1,
      1, 16,
      satioData.formatted_local_time_HHMMSS
      );
      drawSSD1306Canvas(I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, 1);
    }

    // ------------------------------------------------
    // Delay next iteration of task.
    // ------------------------------------------------
    if (TICK_DELAY_TASK_7SEG==false)
      {xTaskNotifyWait(0x00, 0x00, NULL, DELAY_TASK_7SEG / portTICK_PERIOD_MS);}
    else {xTaskNotifyWait(0x00, 0x00, NULL, DELAY_TASK_7SEG);}
  }
}
void createTaskDisplay() {
    xTaskCreatePinnedToCore(
    taskDisplay,   /* Function to implement the task */
    "TaskDisplay", /* Name of the task */
    4096,           /* Stack size in words */
    NULL,           /* Task input parameter */
    4,              /* Priority of the task */
    &TaskDisplay,  /* Task handle. */
    1);             /* Core where the task should run */
    esp_task_wdt_add(TaskDisplay);
}


/** ----------------------------------------------------------------------------
 * Port Controller Input Task.
 * 
 * @brief Reads pins on portcontroller.
 */
void taskPortControllerInput(void * pvParameters) {
  while (global_task_sync==false) {vTaskDelay(1);}
  for (;;) {
    esp_task_wdt_reset();
    // ------------------------------------------------
    // Read Input Port Controller.
    // ------------------------------------------------
    if (readInputPortControllerM1()) {
      systemData.i_count_portcontroller_input++;
      if (systemData.i_count_portcontroller_input>=UINT64_MAX-2)
        {systemData.i_count_portcontroller_input=0;}
    }
    // ------------------------------------------------
    // Delay next iteration of task.
    // ------------------------------------------------
    if (TICK_DELAY_TASK_PORTCONTROLLER_INPUT==false)
      {xTaskNotifyWait(0x00, 0x00, NULL, DELAY_TASK_PORTCONTROLLER_INPUT / portTICK_PERIOD_MS);}
    else {xTaskNotifyWait(0x00, 0x00, NULL, DELAY_TASK_PORTCONTROLLER_INPUT);}
  }
}

void createTaskPortControllerInput() {
    xTaskCreatePinnedToCore(
    taskPortControllerInput,   /* Function to implement the task */
    "TaskPortControllerInput", /* Name of the task */
    4096,           /* Stack size in words */
    NULL,           /* Task input parameter */
    4,              /* Priority of the task */
    &TaskPortControllerInput,  /* Task handle. */
    0);             /* Core where the task should run */
    esp_task_wdt_add(TaskPortControllerInput);
}

/** ----------------------------------------------------------------------------
 * Info Command Task.
 * 
 * @brief Processes a serial TXD and RXD operations:
 *  (1) Information out for other system and debug.
 *  (2) Commands in.
 */
void taskSerialInfoCMD(void * pvParameters) {
  while (global_task_sync==false) {vTaskDelay(1);}
  for (;;) {
    esp_task_wdt_reset();
    // ------------------------------------------------
    // Note that stat is ran in main loop, not here.
    // ------------------------------------------------
    CmdProcess();
    outputSentences();
    // ------------------------------------------------
    // Delay next iteration of task.
    // ------------------------------------------------
    if (TICK_DELAY_TASK_SERIAL_INFOCMD==false)
      {xTaskNotifyWait(0x00, 0x00, NULL, DELAY_TASK_SERIAL_INFOCMD / portTICK_PERIOD_MS);}
    else {xTaskNotifyWait(0x00, 0x00, NULL, DELAY_TASK_SERIAL_INFOCMD);}
  }
}
void createTaskSerialInfoCMD() {
  xTaskCreatePinnedToCore(
    taskSerialInfoCMD,   /* Function to implement the task */
    "TaskSerialInfoCMD", /* Name of the task */
    16384,                /* Stack size in words */
    NULL,                /* Task input parameter */
    3,                   /* Priority of the task */
    &TaskSerialInfoCMD,  /* Task handle. */
    0);                  /* Core where the task should run */
    esp_task_wdt_add(TaskSerialInfoCMD);
}

/** ----------------------------------------------------------------------------
 * Info Command Task.
 * 
 * @brief Reads all analog/digital multiplexer channels.
 */
void taskMultiplexers(void * pvParameters) {
  while (!global_task_sync) {vTaskDelay(pdMS_TO_TICKS(10));}
  for (;;) {
    esp_task_wdt_reset();
    // ------------------------------------------------
    // read muiltiplexer channels (customize as required).
    // ------------------------------------------------
    for (uint8_t i_chan = 0; i_chan < 16; i_chan++) {
      setADMultiplexerChannel(ad_mux_0, i_chan);
      readADMultiplexerAnalogChannel(ad_mux_0, i_chan);
    }
    // ------------------------------------------------
    // Counters
    // ------------------------------------------------
    systemData.i_count_read_mplex++;
    systemData.interval_breach_mplex = 1;
    if (systemData.i_count_read_mplex >= UINT32_MAX - 2)
    systemData.i_count_read_mplex = 0;
    // ------------------------------------------------
    // Delay next iteration of task.
    // ------------------------------------------------
    if (TICK_DELAY_TASK_MULTIPLEXERS==false)
      {xTaskNotifyWait(0x00, 0x00, NULL, DELAY_TASK_MULTIPLEXERS / portTICK_PERIOD_MS);}
    else {xTaskNotifyWait(0x00, 0x00, NULL, DELAY_TASK_MULTIPLEXERS);}
  }
}
void createTaskMultiplexers() {
    xTaskCreatePinnedToCore(
    taskMultiplexers,   /* Function to implement the task */
    "TaskMultiplexers", /* Name of the task */
    4096,               /* Stack size in words */
    NULL,               /* Task input parameter */
    4,                  /* Priority of the task */
    &TaskMultiplexers,  /* Task handle. */
    1);                 /* Core where the task should run */
    esp_task_wdt_add(TaskMultiplexers);
}


/** ----------------------------------------------------------------------------
 * Logging Task.
 * 
 * @brief Writes logs to disk.
 */
void taskLogging(void * pvParameters) {
  for (;;) {
    esp_task_wdt_reset();
    // check disk space
    // delete old logs if required
    // write new log
    // dt,x,y,z
    if (systemData.logging_enabled) {
      Serial.println("[log] setting write flag true");
      sdmmcFlagData.write_log=true;
    }
    // else {Serial.println("[log] not enabled");}
    // ------------------------------------------------
    // Counters
    // ------------------------------------------------.
    systemData.i_count_logging++;
    systemData.interval_breach_logging = 1;
    if (systemData.i_count_logging >= UINT32_MAX - 2)
    systemData.i_count_logging = 0;
    // ------------------------------------------------
    // Delay next iteration of task.
    // ------------------------------------------------
    if (TICK_DELAY_TASK_LOGGING==false)
      {xTaskNotifyWait(0x00, 0x00, NULL, DELAY_TASK_LOGGING / portTICK_PERIOD_MS);}
    else {xTaskNotifyWait(0x00, 0x00, NULL, DELAY_TASK_LOGGING);}
  }
}
void createTaskLogging() {
    xTaskCreatePinnedToCore(
    taskLogging,   /* Function to implement the task */
    "TaskLogging", /* Name of the task */
    4096,               /* Stack size in words */
    NULL,               /* Task input parameter */
    4,                  /* Priority of the task */
    &TaskLogging,  /* Task handle. */
    1);                 /* Core where the task should run */
    esp_task_wdt_add(TaskLogging);
}

/** ----------------------------------------------------------------------------
 * PowerCfg: Ultimate Performance.
 * 
 * @brief Sets all task delay timings to optimum performance.  
 */
void setTasksDelayUltimatePerformance() {
    // DELAY_TASK_SERIAL_INFOCMD=POWER_CONFIG_ULTIMATE_PERFORMANCE_DELAY_TASK_SERIAL_INFOCMD;
    // TICK_DELAY_TASK_SERIAL_INFOCMD=POWER_CONFIG_ULTIMATE_PERFORMANCE_TICK_DELAY_TASK_SERIAL_INFOCMD;
    // xTaskNotifyGive(TaskSerialInfoCMD);

    DELAY_TASK_MULTIPLEXERS=POWER_CONFIG_ULTIMATE_PERFORMANCE_DELAY_TASK_MULTIPLEXERS;
    TICK_DELAY_TASK_MULTIPLEXERS=POWER_CONFIG_ULTIMATE_PERFORMANCE_TICK_DELAY_TASK_MULTIPLEXERS;
    xTaskNotifyGive(TaskMultiplexers);

    DELAY_TASK_GYRO0=POWER_CONFIG_ULTIMATE_PERFORMANCE_DELAY_TASK_GYRO;
    TICK_DELAY_TASK_GYRO0=POWER_CONFIG_ULTIMATE_PERFORMANCE_TICK_DELAY_TASK_GYRO;
    xTaskNotifyGive(TaskGyro);

    DELAY_TASK_UNIVERSE=POWER_CONFIG_ULTIMATE_PERFORMANCE_DELAY_TASK_UNIVERSE;
    TICK_DELAY_TASK_UNIVERSE=POWER_CONFIG_ULTIMATE_PERFORMANCE_TICK_DELAY_TASK_UNIVERSE;
    xTaskNotifyGive(TaskUniverse);

